In [2]:
import pandas as pd

In [15]:
s1 = pd.Series([1116, 12259, 65119, 16699],
index=["서울", "부산", "인천", "대구"])
s1.name = "총 생산량1"
s1.index.name = "지역1"
s1

지역1
서울     1116
부산    12259
인천    65119
대구    16699
Name: 총 생산량1, dtype: int64

In [31]:
s2 = pd.Series([1116, 12259, 65119, 16699],
index=["서울", "부산", "인천", "대구"])
s2.name = "총 생산량2"
s2.index.name = "지역2"
s2

지역2
서울     1116
부산    12259
인천    65119
대구    16699
Name: 총 생산량2, dtype: int64

In [14]:
#name들이 없는 경우
sd1 = pd.DataFrame(s1, columns = ["s1",])
sd1

       s1
서울   1116
부산  12259
인천  65119
대구  16699

In [17]:
#name들이 있는 경우
sd1 = pd.DataFrame(s1)
sd1

     총 생산량1
지역1
서울     1116
부산    12259
인천    65119
대구    16699

여기서 중요한 점은 시리즈에서 name을 설정할 경우 이 것이 데이터프레임으로 변환 시 columns가 된다는 것이다.

In [18]:
sd1.columns

Index(['총 생산량1'], dtype='object')

In [32]:
sd2 = pd.DataFrame(s2)
sd2

     총 생산량2
지역2
서울     1116
부산    12259
인천    65119
대구    16699

In [33]:
all_s = sd1 + sd2
all_s

     총 생산량1  총 생산량2
지역1
서울      NaN     NaN
부산      NaN     NaN
인천      NaN     NaN
대구      NaN     NaN

In [41]:
all_s = pd.DataFrame([s1, s2])
all_s

          서울     부산     인천     대구
총 생산량1  1116  12259  65119  16699
총 생산량2  1116  12259  65119  16699

두 데이터 프레임 합치기

In [42]:
all_s = pd.merge(sd1, sd2, right_index = True,
               left_index = True)
all_s

    총 생산량1  총 생산량2
서울    1116    1116
부산   12259   12259
인천   65119   65119
대구   16699   16699

In [45]:
all_s = sd1["총 생산량1"] + sd2["총 생산량2"]
all_s

지역1
서울      2232
부산     24518
인천    130238
대구     33398
dtype: int64